cmsis-svd/cmsis-svd/data/HDSC/HC32M140FX.svd
                <register>
                    <name>PFD</name>
                    <description>desc PFD</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x1000</resetValue>
                    <resetMask>0xFFF0171F</resetMask>
                    <fields>
                        <field>
                            <name>PCH</name>
                            <description>desc PCH</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PTRGM</name>
                            <description>desc PTRGM</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PVLD</name>
                            <description>desc PVLD</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PFD</name>
                            <description>desc PFD</description>
                            <msb>31</msb>
                            <lsb>20</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADPIN</name>
                    <description>desc ADPIN</description>
                    <addressOffset>0x20</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x1F1F</resetValue>
                    <resetMask>0x1F1F</resetMask>
                    <fields>
                        <field>
                            <name>L1CH</name>
                            <description>desc L1CH</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L2CH</name>
                            <description>desc L2CH</description>
                            <msb>12</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADCMPCTL</name>
                    <description>desc ADCMPCTL</description>
                    <addressOffset>0x24</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>CMPCH</name>
                            <description>desc CMPCH</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMPMD0</name>
                            <description>desc CMPMD0</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMPMD1</name>
                            <description>desc CMPMD1</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMPEN</name>
                            <description>desc CMPEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADCMPD</name>
                    <description>desc ADCMPD</description>
                    <addressOffset>0x26</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFC0</resetMask>
                    <fields>
                        <field>
                            <name>CD</name>
                            <description>desc CD</description>
                            <msb>15</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STSEL</name>
                    <description>desc STSEL</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF0F</resetMask>
                    <fields>
                        <field>
                            <name>STCH0</name>
                            <description>desc STCH0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STCH1</name>
                            <description>desc STCH1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STCH2</name>
                            <description>desc STCH2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STCH3</name>
                            <description>desc STCH3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STCH8</name>
                            <description>desc STCH8</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STCH9</name>
                            <description>desc STCH9</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STCH10</name>
                            <description>desc STCH10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STCH11</name>
                            <description>desc STCH11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STCH12</name>
                            <description>desc STCH12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STCH13</name>
                            <description>desc STCH13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STCH14</name>
                            <description>desc STCH14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STCH15</name>
                            <description>desc STCH15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STS0</name>
                    <description>desc STS0</description>
                    <addressOffset>0x30</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x2</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>TM0</name>
                            <description>desc TM0</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STS1</name>
                    <description>desc STS1</description>
                    <addressOffset>0x31</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x2</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>TM1</name>
                            <description>desc TM1</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADCDIV</name>
                    <description>desc ADCDIV</description>
                    <addressOffset>0x34</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0x7F</resetMask>
                    <fields>
                        <field>
                            <name>DIV</name>
                            <description>desc DIV</description>
                            <msb>6</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADCSTSL</name>
                    <description>desc ADCSTSL</description>
                    <addressOffset>0x38</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>STRGIN</name>
                            <description>desc STRGIN</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADCPTSL</name>
                    <description>desc ADCPTSL</description>
                    <addressOffset>0x39</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>PTRGIN</name>
                            <description>desc PTRGIN</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADEN</name>
                    <description>desc ADEN</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0xFF00</resetValue>
                    <resetMask>0xFF03</resetMask>
                    <fields>
                        <field>
                            <name>AD_EN</name>
                            <description>desc AD_EN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENRDY</name>
                            <description>desc ENRDY</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ENTM</name>
                            <description>desc ENTM</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADRCMPCTL</name>
                    <description>desc ADRCMPCTL</description>
                    <addressOffset>0x48</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x20</resetValue>
                    <resetMask>0xE0F4</resetMask>
                    <fields>
                        <field>
                            <name>RCMPEN</name>
                            <description>desc RCMPEN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RCMPTRG</name>
                            <description>desc RCMPTRG</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RCMPCNT</name>
                            <description>desc RCMPCNT</description>
                            <msb>7</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RCMPCN_ST</name>
                            <description>desc RCMPCN_ST</description>
                            <msb>15</msb>
                            <lsb>13</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADRCMPS</name>
                    <description>desc ADRCMPS</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F</resetMask>
                    <fields>
                        <field>
                            <name>RCMPCH</name>
                            <description>desc RCMPCH</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RCMPMD</name>
                            <description>desc RCMPMD</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADRCMPL</name>
                    <description>desc ADRCMPL</description>
                    <addressOffset>0x50</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFC0</resetMask>
                    <fields>
                        <field>
                            <name>CDL</name>
                            <description>desc CDL</description>
                            <msb>15</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADRCMPH</name>
                    <description>desc ADRCMPH</description>
                    <addressOffset>0x52</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFC0</resetMask>
                    <fields>
                        <field>
                            <name>CDH</name>
                            <description>desc CDH</description>
                            <msb>15</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADRCMPF</name>
                    <description>desc ADRCMPF</description>
                    <addressOffset>0x54</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>RCMPF</name>
                            <description>desc RCMPF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
