cmsis-svd/cmsis-svd/data/HDSC/HC32M140FX.svd
                <register>
                    <name>ODR4</name>
                    <description>desc ODR4</description>
                    <addressOffset>0x710</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F</resetMask>
                    <fields>
                        <field>
                            <name>P40</name>
                            <description>desc P40</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P41</name>
                            <description>desc P41</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P42</name>
                            <description>desc P42</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P43</name>
                            <description>desc P43</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P44</name>
                            <description>desc P44</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P45</name>
                            <description>desc P45</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P46</name>
                            <description>desc P46</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ODR6</name>
                    <description>desc ODR6</description>
                    <addressOffset>0x718</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>P60</name>
                            <description>desc P60</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P61</name>
                            <description>desc P61</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ODR7</name>
                    <description>desc ODR7</description>
                    <addressOffset>0x71C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F</resetMask>
                    <fields>
                        <field>
                            <name>P70</name>
                            <description>desc P70</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P71</name>
                            <description>desc P71</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P72</name>
                            <description>desc P72</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P73</name>
                            <description>desc P73</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P74</name>
                            <description>desc P74</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P75</name>
                            <description>desc P75</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FSETE0</name>
                    <description>desc FSETE0</description>
                    <addressOffset>0x900</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x80</resetMask>
                    <fields>
                        <field>
                            <name>P07</name>
                            <description>desc P07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FSETE1</name>
                    <description>desc FSETE1</description>
                    <addressOffset>0x904</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F</resetMask>
                    <fields>
                        <field>
                            <name>P10</name>
                            <description>desc P10</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P11</name>
                            <description>desc P11</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P12</name>
                            <description>desc P12</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P13</name>
                            <description>desc P13</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P14</name>
                            <description>desc P14</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P15</name>
                            <description>desc P15</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P16</name>
                            <description>desc P16</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FSETE2</name>
                    <description>desc FSETE2</description>
                    <addressOffset>0x908</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>P20</name>
                            <description>desc P20</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FSETE3</name>
                    <description>desc FSETE3</description>
                    <addressOffset>0x90C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x3</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>P30</name>
                            <description>desc P30</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P31</name>
                            <description>desc P31</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P32</name>
                            <description>desc P32</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FSETE4</name>
                    <description>desc FSETE4</description>
                    <addressOffset>0x910</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F</resetMask>
                    <fields>
                        <field>
                            <name>P40</name>
                            <description>desc P40</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P41</name>
                            <description>desc P41</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P42</name>
                            <description>desc P42</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P43</name>
                            <description>desc P43</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P44</name>
                            <description>desc P44</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P45</name>
                            <description>desc P45</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P46</name>
                            <description>desc P46</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FSETE6</name>
                    <description>desc FSETE6</description>
                    <addressOffset>0x918</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>P60</name>
                            <description>desc P60</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P61</name>
                            <description>desc P61</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FSETE7</name>
                    <description>desc FSETE7</description>
                    <addressOffset>0x91C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F</resetMask>
                    <fields>
                        <field>
                            <name>P70</name>
                            <description>desc P70</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P71</name>
                            <description>desc P71</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P72</name>
                            <description>desc P72</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P73</name>
                            <description>desc P73</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P74</name>
                            <description>desc P74</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>P75</name>
                            <description>desc P75</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
