cmsis-svd/cmsis-svd/data/HDSC/HC32M140FX.svd
                <register>
                    <name>POCR32</name>
                    <description>desc POCR32</description>
                    <addressOffset>0x9C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF7</resetMask>
                    <fields>
                        <field>
                            <name>DIVCK</name>
                            <description>desc DIVCK</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WMD</name>
                            <description>desc WMD</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LVLS</name>
                            <description>desc LVLS</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POCR54</name>
                    <description>desc POCR54</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF7</resetMask>
                    <fields>
                        <field>
                            <name>DIVCK</name>
                            <description>desc DIVCK</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WMD</name>
                            <description>desc WMD</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LVLS</name>
                            <description>desc LVLS</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCSR</name>
                    <description>desc RCSR</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF7</resetMask>
                    <fields>
                        <field>
                            <name>RTID10</name>
                            <description>desc RTID10</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTID32</name>
                            <description>desc RTID32</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTID54</name>
                            <description>desc RTID54</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTIF10</name>
                            <description>desc RTIF10</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RTIC10</name>
                            <description>desc RTIC10</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RTE10</name>
                            <description>desc RTE10</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTS10</name>
                            <description>desc RTS10</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RTIF32</name>
                            <description>desc RTIF32</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RTIC32</name>
                            <description>desc RTIC32</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RTE32</name>
                            <description>desc RTE32</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTS32</name>
                            <description>desc RTS32</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RTIF54</name>
                            <description>desc RTIF54</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RTIC54</name>
                            <description>desc RTIC54</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>RTE54</name>
                            <description>desc RTE54</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTS54</name>
                            <description>desc RTS54</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ATVR0</name>
                    <description>desc ATVR0</description>
                    <addressOffset>0xB2</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>ATVR1</name>
                    <description>desc ATVR1</description>
                    <addressOffset>0xB6</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>ATVR2</name>
                    <description>desc ATVR2</description>
                    <addressOffset>0xBA</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>ATVR3</name>
                    <description>desc ATVR3</description>
                    <addressOffset>0xBE</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>ATVR4</name>
                    <description>desc ATVR4</description>
                    <addressOffset>0xC2</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>ATVR5</name>
                    <description>desc ATVR5</description>
                    <addressOffset>0xC6</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>ATCR0</name>
                    <description>desc ATCR0</description>
                    <addressOffset>0xC8</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F</resetMask>
                    <fields>
                        <field>
                            <name>BUFEN</name>
                            <description>desc BUFEN</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADTRGS</name>
                            <description>desc ADTRGS</description>
                            <msb>4</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LMC</name>
                            <description>desc LMC</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ATER0</name>
                    <description>desc ATER0</description>
                    <addressOffset>0xC9</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF3</resetMask>
                    <fields>
                        <field>
                            <name>TRGMD</name>
                            <description>desc TRGMD</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCS</name>
                            <description>desc OCS</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEN</name>
                            <description>desc DEN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PEN</name>
                            <description>desc PEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UEN</name>
                            <description>desc UEN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ZEN</name>
                            <description>desc ZEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ATMR0</name>
                    <description>desc ATMR0</description>
                    <addressOffset>0xCA</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xCF</resetMask>
                    <fields>
                        <field>
                            <name>AMC</name>
                            <description>desc AMC</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MZCE</name>
                            <description>desc MZCE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MPCE</name>
                            <description>desc MPCE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ATCR1</name>
                    <description>desc ATCR1</description>
                    <addressOffset>0xCC</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F</resetMask>
                    <fields>
                        <field>
                            <name>BUFEN</name>
                            <description>desc BUFEN</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADTRGS</name>
                            <description>desc ADTRGS</description>
                            <msb>4</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LMC</name>
                            <description>desc LMC</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ATER1</name>
                    <description>desc ATER1</description>
                    <addressOffset>0xCD</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF3</resetMask>
                    <fields>
                        <field>
                            <name>TRGMD</name>
                            <description>desc TRGMD</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCS</name>
                            <description>desc OCS</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEN</name>
                            <description>desc DEN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PEN</name>
                            <description>desc PEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UEN</name>
                            <description>desc UEN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ZEN</name>
                            <description>desc ZEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ATMR1</name>
                    <description>desc ATMR1</description>
                    <addressOffset>0xCE</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xCF</resetMask>
                    <fields>
                        <field>
                            <name>AMC</name>
                            <description>desc AMC</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MZCE</name>
                            <description>desc MZCE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MPCE</name>
                            <description>desc MPCE</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ATCR2</name>
                    <description>desc ATCR2</description>
                    <addressOffset>0xD0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3F</resetMask>
                    <fields>
                        <field>
                            <name>BUFEN</name>
                            <description>desc BUFEN</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADTRGS</name>
                            <description>desc ADTRGS</description>
                            <msb>4</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LMC</name>
                            <description>desc LMC</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
